In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# data

In [110]:
df = pd.read_csv('data/marketing_campaign.csv', sep='\t')

In [111]:
cust_info = ['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
              'Teenhome', 'Dt_Customer', 'Recency', 'Complain']

product = ['MntWines', 'MntFruits', 'MntMeatProducts', 'MntFishProducts',
            'MntSweetProducts', 'MntGoldProds']

promotion = ['NumDealsPurchases', 'AcceptedCmp1', 'AcceptedCmp2', 'AcceptedCmp3',
              'AcceptedCmp4', 'AcceptedCmp5', 'Response']

place = ['NumWebPurchases', 'NumCatalogPurchases', 'NumStorePurchases',
          'NumWebVisitsMonth']

## clean

In [112]:
df = df.drop(columns=['Z_CostContact', 'Z_Revenue'])

In [113]:
df

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,10,4,7,0,0,0,0,0,0,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,1,2,5,0,0,0,0,0,0,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,2,10,4,0,0,0,0,0,0,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,0,4,6,0,0,0,0,0,0,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,3,6,5,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,3,4,5,0,0,0,0,0,0,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,2,5,7,0,0,0,1,0,0,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,3,13,6,0,1,0,0,0,0,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,5,10,3,0,0,0,0,0,0,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,1,4,7,0,0,0,0,0,0,1

### categorical

In [114]:
cat = df.select_dtypes(include='object')

In [115]:
df['Dt_Customer'] = pd.to_datetime(df['Dt_Customer'], format='%d-%m-%Y')

In [116]:
cat['Education'].value_counts()

Education
Graduation    1127
PhD            486
Master         370
2n Cycle       203
Basic           54
Name: count, dtype: int64

**Order:**
  - Basic
  - Graduation
  - 2n Cycle
  - Master
  - PhD

In [117]:
# turning the catetorical variable into a numerical one by mapping the values to numbers
df['Education'] = df['Education'].map({'Basic': 1, 'Graduation': 2, '2n Cycle': 3, 'Master': 4, 'PhD': 5})

In [118]:
cat['Marital_Status'].value_counts()

Marital_Status
Married     864
Together    580
Single      480
Divorced    232
Widow        77
Alone         3
Absurd        2
YOLO          2
Name: count, dtype: int64

 - combine YOLO, Absurd, Alone, Divorced, Widow and Single together (1)
 - combine Married and Together (2)

In [119]:
df['single_status'] = df['Marital_Status'].apply(lambda x: 2 if x in ['Married', 'Together'] else 1)

In [120]:
df['single_status'].value_counts()

single_status
2    1444
1     796
Name: count, dtype: int64

### numerical

In [121]:
num = df.select_dtypes(include='number')

In [122]:
num.columns

Index(['ID', 'Year_Birth', 'Education', 'Income', 'Kidhome', 'Teenhome',
       'Recency', 'MntWines', 'MntFruits', 'MntMeatProducts',
       'MntFishProducts', 'MntSweetProducts', 'MntGoldProds',
       'NumDealsPurchases', 'NumWebPurchases', 'NumCatalogPurchases',
       'NumStorePurchases', 'NumWebVisitsMonth', 'AcceptedCmp3',
       'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1', 'AcceptedCmp2',
       'Complain', 'Response', 'single_status'],
      dtype='object')

In [123]:
df['children'] = df['Kidhome'] + df['Teenhome']

In [124]:
df['household_n'] = df['children'] + df['single_status']

In [125]:
df['total_spend'] = df[product].sum(axis=1)

In [126]:
df

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Response,single_status,children,household_n,total_spend
0,5524,1957,2,Single,58138.0,0,0,2012-09-04,58,635,...,0,0,0,0,0,1,1,0,1,1617
1,2174,1954,2,Single,46344.0,1,1,2014-03-08,38,11,...,0,0,0,0,0,0,1,2,3,27
2,4141,1965,2,Together,71613.0,0,0,2013-08-21,26,426,...,0,0,0,0,0,0,2,0,2,776
3,6182,1984,2,Together,26646.0,1,0,2014-02-10,26,11,...,0,0,0,0,0,0,2,1,3,53
4,5324,1981,5,Married,58293.0,1,0,2014-01-19,94,173,...,0,0,0,0,0,0,2,1,3,422
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,2,Married,61223.0,0,1,2013-06-13,46,709,...,0,0,0,0,0,0,2,1,3,1341
2236,4001,1946,5,Together,64014.0,2,1,2014-06-10,56,406,...,0,0,1,0,0,0,2,3,5,444
2237,7270,1981,2,Divorced,56981.0,0,0,2014-01-25,91,908,...,1,0,0,0,0,0,1,0,1,1241
2238,8235,1956,4,Together,69245.0,0,1,2014-01-24,8,428,...,0,0,0,0,0,0,2,1,3,843
2239,9405,1954,5,Married,52869.0,1,1,2012-10-15,40,84,...,0,0,0,0,0,1,2,2,4,172